TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdenum.c
    //
    // Is remote wake up signaling currently enabled?
    //
    if(g_psUSBDevice[0].ucStatus & USB_STATUS_REMOTE_WAKE)
    {
        //
        // The host has not disabled remote wake up. Are we still in the
        // middle of a previous wake up sequence?
        //
        if(!g_psUSBDevice[0].bRemoteWakeup)
        {
            //
            // No - we are not in the middle of a wake up sequence so start
            // one here.
            //
            g_psUSBDevice[0].ucRemoteWakeupCount = 0;
            g_psUSBDevice[0].bRemoteWakeup = true;
            USBHostResume(USB0_BASE, true);
            return(true);
        }
    }

    //
    // If we drop through to here, signaling was not initiated so return
    // false.
    return(false);
}

//*****************************************************************************
//
// Internal Functions, not to be called by applications
//
//*****************************************************************************

//*****************************************************************************
//
// This internal function is called on the SOF interrupt to process any
// outstanding remote wake up requests.
//
// \return None.
//
//*****************************************************************************
void
USBDeviceResumeTickHandler(tDeviceInstance *psDevInst)
{
    if(g_psUSBDevice[0].bRemoteWakeup)
    {
        //
        // Increment the millisecond counter we use to time the resume
        // signaling.
        //
        g_psUSBDevice[0].ucRemoteWakeupCount++;

        //
        // Have we reached the 10mS mark? If so, we need to turn the signaling
        // off again.
        //
        if(g_psUSBDevice[0].ucRemoteWakeupCount == REMOTE_WAKEUP_PULSE_MS)
        {
            USBHostResume(USB0_BASE, false);
        }

        //
        // Have we reached the point at which we can tell the client that the
        // bus has resumed? The controller doesn't give us an interrupt if we
        // initiated the wake up signaling so we just wait until 20mS have
        // passed then tell the client all is well.
        //
        if(g_psUSBDevice[0].ucRemoteWakeupCount == REMOTE_WAKEUP_READY_MS)
        {
            //
            // We are now finished with the remote wake up signaling.
            //
            g_psUSBDevice[0].bRemoteWakeup = false;

            //
            // If the client has registered a resume callback, call it.  In the
            // case of a remote wake up request, we do not get a resume
            // interrupt from the controller so we need to fake it here.
            //
            if(g_psUSBDevice[0].psInfo->sCallbacks.pfnResumeHandler)
            {
                g_psUSBDevice[0].psInfo->sCallbacks.pfnResumeHandler(
                    g_psUSBDevice[0].pvInstance);
            }
        }
    }
}

//*****************************************************************************
//
// This internal function reads a request data packet and dispatches it to
// either a standard request handler or the registered device request
// callback depending upon the request type.
//
// \return None.
//
//*****************************************************************************
static void
USBDReadAndDispatchRequest(unsigned long ulIndex)
{
    unsigned long ulSize;
    tUSBRequest *pRequest;

    //
    // Cast the buffer to a request structure.
    //
    pRequest = (tUSBRequest *)g_pucDataBufferIn;

    //
    // Set the buffer size.
    //
    ulSize = EP0_MAX_PACKET_SIZE;

    //
    // Get the data from the USB controller end point 0.
    //
    USBEndpointDataGet(USB0_BASE,
                       USB_EP_0,
                       g_pucDataBufferIn,
                       &ulSize);

    //
    // If there was a null setup packet then just return.
    //
    if(!ulSize)
    {
        return;
    }

    //
    // See if this is a standard request or not.
    //
    if((pRequest->bmRequestType & USB_RTYPE_TYPE_M) != USB_RTYPE_STANDARD)
    {
        //
        // Since this is not a standard request, see if there is
        // an external handler present.
        //
        if(g_psUSBDevice[0].psInfo->sCallbacks.pfnRequestHandler)
        {
            g_psUSBDevice[0].psInfo->sCallbacks.pfnRequestHandler(
                g_psUSBDevice[0].pvInstance, pRequest);
        }
        else
        {
            //
            // If there is no handler then stall this request.
            //
            USBDCDStallEP0(0);
        }
    }
    else
    {
        //
        // Assure that the jump table is not out of bounds.
        //
        if((pRequest->bRequest <
                (sizeof(g_psUSBDStdRequests) / sizeof(tStdRequest))) &&
                (g_psUSBDStdRequests[pRequest->bRequest] != 0))
        {
            //
            // Jump table to the appropriate handler.
            //
            g_psUSBDStdRequests[pRequest->bRequest](&g_psUSBDevice[0],
                                                    pRequest);
        }
        else
        {
            //
            // If there is no handler then stall this request.
            //
            USBDCDStallEP0(0);
        }
    }
}

//*****************************************************************************
//
// This is interrupt handler for endpoint zero.
//
// This function handles all interrupts on endpoint zero in order to maintain
// the state needed for the control endpoint on endpoint zero.  In order to
// successfully enumerate and handle all USB standard requests, all requests
// on endpoint zero must pass through this function.  The endpoint has the
// following states: \b USB_STATE_IDLE, \b USB_STATE_TX, \b USB_STATE_RX,
// \b USB_STATE_STALL, and \b USB_STATE_STATUS.  In the \b USB_STATE_IDLE
// state the USB controller has not received the start of a request, and once
// it does receive the data for the request it will either enter the
// \b USB_STATE_TX, \b USB_STATE_RX, or \b USB_STATE_STALL depending on the
// command.  If the controller enters the \b USB_STATE_TX or \b USB_STATE_RX
// then once all data has been sent or received, it must pass through the
// \b USB_STATE_STATUS state to allow the host to acknowledge completion of
// the request.  The \b USB_STATE_STALL is entered from \b USB_STATE_IDLE in
// the event that the USB request was not valid.  Both the \b USB_STATE_STALL
// and \b USB_STATE_STATUS are transitional states that return to the
// \b USB_STATE_IDLE state.
//
// \return None.
//
// USB_STATE_IDLE -*--> USB_STATE_TX -*-> USB_STATE_STATUS -*->USB_STATE_IDLE
//                 |                  |                     |
//                 |--> USB_STATE_RX -                      |
//                 |                                        |
//                 |--> USB_STATE_STALL ---------->---------
//
//  ----------------------------------------------------------------
// | Current State       | State 0           | State 1              |
// | --------------------|-------------------|----------------------
// | USB_STATE_IDLE      | USB_STATE_TX/RX   | USB_STATE_STALL      |
// | USB_STATE_TX        | USB_STATE_STATUS  |                      |
// | USB_STATE_RX        | USB_STATE_STATUS  |                      |
// | USB_STATE_STATUS    | USB_STATE_IDLE    |                      |
// | USB_STATE_STALL     | USB_STATE_IDLE    |                      |
//  ----------------------------------------------------------------
//
//*****************************************************************************
void
USBDeviceEnumHandler(tDeviceInstance *pDevInstance)
{
    unsigned long ulEPStatus;

    //
    // Get the end point 0 status.
    //
    ulEPStatus = USBEndpointStatus(USB0_BASE, USB_EP_0);

    switch(pDevInstance->eEP0State)
    {
        //
        // Handle the status state, this is a transitory state from
        // USB_STATE_TX or USB_STATE_RX back to USB_STATE_IDLE.
        //
    case USB_STATE_STATUS:
    {
        //
        // Just go back to the idle state.
        //
        pDevInstance->eEP0State = USB_STATE_IDLE;

        //
        // If there is a pending address change then set the address.
        //
        if(pDevInstance->ulDevAddress & DEV_ADDR_PENDING)
        {
            //
            // Clear the pending address change and set the address.
            //
            pDevInstance->ulDevAddress &= ~DEV_ADDR_PENDING;
            USBDevAddrSet(USB0_BASE, pDevInstance->ulDevAddress);
        }

        //
        // If a new packet is already pending, we need to read it
        // and handle whatever request it contains.
        //
        if(ulEPStatus & USB_DEV_EP0_OUT_PKTRDY)
        {
            //
            // Process the newly arrived packet.
            //
            USBDReadAndDispatchRequest(0);
        }
        break;
    }

    //
    // In the IDLE state the code is waiting to receive data from the host.
    //
    case USB_STATE_IDLE:
    {
        //
        // Is there a packet waiting for us?
        //
        if(ulEPStatus & USB_DEV_EP0_OUT_PKTRDY)
        {
            //
            // Yes - process it.
            //
            USBDReadAndDispatchRequest(0);
        }
        break;
    }

    //
    // Data is still being sent to the host so handle this in the
    // EP0StateTx() function.
    //
    case USB_STATE_TX:
    {
        USBDEP0StateTx(0);
        break;
    }

    //
    // We are still in the middle of sending the configuration descriptor
    // so handle this in the EP0StateTxConfig() function.
    //
    case USB_STATE_TX_CONFIG:
    {
        USBDEP0StateTxConfig(0);
        break;
    }

    //
    // Handle the receive state for commands that are receiving data on
    // endpoint zero.
    //
    case USB_STATE_RX:
    {
        unsigned long ulDataSize;

        //
        // Set the number of bytes to get out of this next packet.
        //
        if(pDevInstance->ulEP0DataRemain > EP0_MAX_PACKET_SIZE)
        {
            //
            // Don't send more than EP0_MAX_PACKET_SIZE bytes.
            //
            ulDataSize = EP0_MAX_PACKET_SIZE;
        }
        else
        {
            //
            // There was space so send the remaining bytes.
            //
            ulDataSize = pDevInstance->ulEP0DataRemain;
        }

        //
        // Get the data from the USB controller end point 0.
        //
        USBEndpointDataGet(USB0_BASE, USB_EP_0, pDevInstance->pEP0Data,
                           &ulDataSize);

        //
        // If there we not more that EP0_MAX_PACKET_SIZE or more bytes
        // remaining then this transfer is complete.  If there were exactly
        // EP0_MAX_PACKET_SIZE remaining then there still needs to be
        // null packet sent before this is complete.
        //
        if(pDevInstance->ulEP0DataRemain < EP0_MAX_PACKET_SIZE)
        {
            //
            // Need to ACK the data on end point 0 in this case and set the
            // data end as this is the last of the data.
            //
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

            //
            // Return to the idle state.
            //
                pDevInstance->eEP0State =  USB_STATE_STATUS;

            //
            // If there is a receive callback then call it.
            //
            if((pDevInstance->psInfo->sCallbacks.pfnDataReceived) &&
                    (pDevInstance->ulOUTDataSize != 0))
            {
                //
                // Call the custom receive handler to handle the data
                // that was received.
                //
                pDevInstance->psInfo->sCallbacks.pfnDataReceived(
                    pDevInstance->pvInstance,
                    pDevInstance->ulOUTDataSize);

                //
                // Indicate that there is no longer any data being waited
                // on.
                //
                pDevInstance->ulOUTDataSize = 0;
            }
        }
        else
        {
            //
            // Need to ACK the data on end point 0 in this case
            // without setting data end because more data is coming.
            //
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
        }

        //
        // Advance the pointer.
        //
        pDevInstance->pEP0Data += ulDataSize;

        //
        // Decrement the number of bytes that are being waited on.
        //
        pDevInstance->ulEP0DataRemain -= ulDataSize;

        break;
    }
    //
    // The device stalled endpoint zero so check if the stall needs to be
    // cleared once it has been successfully sent.
    //
    case USB_STATE_STALL:
    {
        //
        // If we sent a stall then acknowledge this interrupt.
        //
        if(ulEPStatus & USB_DEV_EP0_SENT_STALL)
        {
            //
            // Clear the Setup End condition.
            //
            USBDevEndpointStatusClear(USB0_BASE, USB_EP_0,
                                      USB_DEV_EP0_SENT_STALL);

            //
            // Reset the global end point 0 state to IDLE.
            //
            pDevInstance->eEP0State = USB_STATE_IDLE;

