TexasInstruments/c2000ware-core-sdk/device_support/f2806x/examples/c28/bl_app/deprecated/usblib/device/usbdenum.c
        }
        break;
    }
    //
    // Halt on an unknown state, but only in DEBUG mode builds.
    //
    default:
    {
        ASSERT(0);
    }
    }
}

//*****************************************************************************
//
// This function handles bus reset notifications.
//
// This function is called from the low level USB interrupt handler whenever
// a bus reset is detected.  It performs tidy-up as required and resets the
// configuration back to defaults in preparation for descriptor queries from
// the host.
//
// \return None.
//
//*****************************************************************************
void
USBDeviceEnumResetHandler(tDeviceInstance *pDevInstance)
{
    unsigned long ulLoop;

    //
    // Disable remote wake up signaling (as per USB 2.0 spec 9.1.1.6).
    //
    pDevInstance->ucStatus &= ~USB_STATUS_REMOTE_WAKE;
    pDevInstance->bRemoteWakeup = false;

    //
    // Call the device dependent code to indicate a bus reset has occurred.
    //
    if(pDevInstance->psInfo->sCallbacks.pfnResetHandler)
    {
        pDevInstance->psInfo->sCallbacks.pfnResetHandler(
            pDevInstance->pvInstance);
    }

    //
    // Reset the default configuration identifier and alternate function
    // selections.
    //
    pDevInstance->ulConfiguration = pDevInstance->ulDefaultConfiguration;

    for(ulLoop = 0; ulLoop < USB_MAX_INTERFACES_PER_DEVICE; ulLoop++)
    {
        pDevInstance->pucAltSetting[ulLoop] = (unsigned char)0;
    }
}

//*****************************************************************************
//
// This function handles the GET_STATUS standard USB request.
//
// \param pvInstance is the USB device controller instance data.
// \param pUSBRequest holds the request type and endpoint number if endpoint
// status is requested.
//
// This function handles responses to a Get Status request from the host
// controller.  A status request can be for the device, an interface or an
// endpoint.  If any other type of request is made this function will cause
// a stall condition to indicate that the command is not supported.  The
// \e pUSBRequest structure holds the type of the request in the
// bmRequestType field.  If the type indicates that this is a request for an
// endpoint's status, then the wIndex field holds the endpoint number.
//
// \return None.
//
//*****************************************************************************
static void
USBDGetStatus(void *pvInstance, tUSBRequest *pUSBRequest)
{
    unsigned short usData;
    tDeviceInstance *psUSBControl;

    ASSERT(pUSBRequest != 0);
    ASSERT(pvInstance != 0);

    //
    // Create the device information pointer.
    //
    psUSBControl = (tDeviceInstance *)pvInstance;

    //
    // Need to ACK the data on end point 0 without setting last data as there
    // will be a data phase.
    //
    USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);

    //
    // Determine what type of status was requested.
    //
    switch(pUSBRequest->bmRequestType & USB_RTYPE_RECIPIENT_M)
    {
        //
        // This was a Device Status request.
        //
    case USB_RTYPE_DEVICE:
    {
        //
        // Return the current status for the device.
        //
        usData = (unsigned short)psUSBControl->ucStatus;

        break;
    }

    //
    // This was a Interface status request.
    //
    case USB_RTYPE_INTERFACE:
    {
        //
        // Interface status always returns 0.
        //
        usData = (unsigned short)0;

        break;
    }

    //
    // This was an endpoint status request.
    //
    case USB_RTYPE_ENDPOINT:
    {
        unsigned short usIndex;
        unsigned long ulDir;

        //
        // Which endpoint are we dealing with?
        //
        usIndex = readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_NUM_M;

        //
        // Check if this was a valid endpoint request.
        //
        if((usIndex == 0) || (usIndex >= NUM_USB_EP))
        {
            USBDCDStallEP0(0);
            return;
        }
        else
        {
            //
            // Are we dealing with an IN or OUT endpoint?
            //
            ulDir = ((readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_DIR_M) ==
                     USB_REQ_EP_DIR_IN) ? HALT_EP_IN : HALT_EP_OUT;

            //
            // Get the current halt status for this endpoint.
            //
            usData =
                (unsigned short)psUSBControl->ucHalt[ulDir][usIndex - 1];
        }
        break;
    }

    //
    // This was an unknown request.
    //
    default:
    {
        //
        // Anything else causes a stall condition to indicate that the
        // command was not supported.
        //
        USBDCDStallEP0(0);
        return;
    }
    }

    //
    // Send the two byte status response.
    //
    psUSBControl->ulEP0DataRemain = 2;
    psUSBControl->pEP0Data = (unsigned char *)&usData;

    //
    // Send the response.
    //
    USBDEP0StateTx(0);
}

//*****************************************************************************
//
// This function handles the CLEAR_FEATURE standard USB request.
//
// \param pvInstance is the USB device controller instance data.
// \param pUSBRequest holds the options for the Clear Feature USB request.
//
// This function handles device or endpoint clear feature requests.  The
// \e pUSBRequest structure holds the type of the request in the bmRequestType
// field and the feature is held in the wValue field.  The device can only
// clear the Remote Wake feature.  This device request should only be made if
// the descriptor indicates that Remote Wake is implemented by the device.
// Endpoints can only clear a halt on a given endpoint.  If any other
// requests are made, then the device will stall the request to indicate to
// the host that the command was not supported.
//
// \return None.
//
//*****************************************************************************
static void
USBDClearFeature(void *pvInstance, tUSBRequest *pUSBRequest)
{
    tDeviceInstance *psUSBControl;

    ASSERT(pUSBRequest != 0);
    ASSERT(pvInstance != 0);

    //
    // Create the device information pointer.
    //
    psUSBControl = (tDeviceInstance *)pvInstance;

    //
    // Need to ACK the data on end point 0 with last data set as this has no
    // data phase.
    //
    USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

    //
    // Determine what type of status was requested.
    //
    switch(pUSBRequest->bmRequestType & USB_RTYPE_RECIPIENT_M)
    {
        //
        // This is a clear feature request at the device level.
        //
    case USB_RTYPE_DEVICE:
    {
        //
        // Only remote wake is can be cleared by this function.
        //
        if(USB_FEATURE_REMOTE_WAKE & readShort(&(pUSBRequest->wValue)))
        {
            //
            // Clear the remote wake up state.
            //
            psUSBControl->ucStatus &= ~USB_STATUS_REMOTE_WAKE;
        }
        else
        {
            USBDCDStallEP0(0);
        }
        break;
    }

    //
    // This is a clear feature request at the endpoint level.
    //
    case USB_RTYPE_ENDPOINT:
    {
        unsigned long ulDir;
        unsigned short usIndex;

        //
        // Which endpoint are we dealing with?
        //
        usIndex = readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_NUM_M;

        //
        // Not a valid endpoint.
        //
        if((usIndex == 0) || (usIndex > NUM_USB_EP))
        {
            USBDCDStallEP0(0);
        }
        else
        {
            //
            // Only the halt feature is supported.
            //
            if(USB_FEATURE_EP_HALT == readShort(&(pUSBRequest->wValue)))
            {
                //
                // Are we dealing with an IN or OUT endpoint?
                //
                ulDir = ((readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_DIR_M) ==
                         USB_REQ_EP_DIR_IN) ? HALT_EP_IN : HALT_EP_OUT;

                //
                // Clear the halt condition on this endpoint.
                //
                psUSBControl->ucHalt[ulDir][usIndex - 1] = 0;

                if(ulDir == HALT_EP_IN)
                {
                    USBDevEndpointStallClear(USB0_BASE,
                                             INDEX_TO_USB_EP(usIndex),
                                             USB_EP_DEV_IN);
                }
                else
                {
                    USBDevEndpointStallClear(USB0_BASE,
                                             INDEX_TO_USB_EP(usIndex),
                                             USB_EP_DEV_OUT);
                }
            }
            else
            {
                //
                // If any other feature is requested, this is an error.
                //
                USBDCDStallEP0(0);
                return;
            }
        }
        break;
    }

    //
    // This is an unknown request.
    //
    default:
    {
        USBDCDStallEP0(0);
        return;
    }
    }
}

//*****************************************************************************
//
// This function handles the SET_FEATURE standard USB request.
//
// \param pvInstance is the USB device controller instance data.
// \param pUSBRequest holds the feature in the wValue field of the USB
// request.
//
// This function handles device or endpoint set feature requests.  The
// \e pUSBRequest structure holds the type of the request in the bmRequestType
// field and the feature is held in the wValue field.  The device can only
// set the Remote Wake feature.  This device request should only be made if the
// descriptor indicates that Remote Wake is implemented by the device.
// Endpoint requests can only issue a halt on a given endpoint.  If any other
// requests are made, then the device will stall the request to indicate to the
// host that the command was not supported.
//
// \return None.
//
//*****************************************************************************
static void
USBDSetFeature(void *pvInstance, tUSBRequest *pUSBRequest)
{
    tDeviceInstance *psUSBControl;

    ASSERT(pUSBRequest != 0);
    ASSERT(pvInstance != 0);

    //
    // Create the device information pointer.
    //
    psUSBControl = (tDeviceInstance *)pvInstance;

    //
    // Need to ACK the data on end point 0 with last data set as this has no
    // data phase.
    //
    USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

    //
    // Determine what type of status was requested.
    //
    switch(pUSBRequest->bmRequestType & USB_RTYPE_RECIPIENT_M)
    {
        //
        // This is a set feature request at the device level.
        //
    case USB_RTYPE_DEVICE:
    {
        //
        // Only remote wake is the only feature that can be set by this
        // function.
        //
        if(USB_FEATURE_REMOTE_WAKE & readShort(&(pUSBRequest->wValue)))
        {
            //
            // Set the remote wake up state.
            //
            psUSBControl->ucStatus |= USB_STATUS_REMOTE_WAKE;
        }
        else
        {
            USBDCDStallEP0(0);
        }
        break;
    }

    //
    // This is a set feature request at the endpoint level.
    //
    case USB_RTYPE_ENDPOINT:
    {
        unsigned short usIndex;
        unsigned long ulDir;

        //
        // Which endpoint are we dealing with?
        //
        usIndex = readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_NUM_M;

        //
        // Not a valid endpoint?
        //
        if((usIndex == 0) || (usIndex >= NUM_USB_EP))
        {
            USBDCDStallEP0(0);
        }
        else
        {
            //
            // Only the Halt feature can be set.
            //
            if(USB_FEATURE_EP_HALT == readShort(&(pUSBRequest->wValue)))
            {
                //
                // Are we dealing with an IN or OUT endpoint?
                //
                ulDir = ((readShort(&(pUSBRequest->wIndex)) & USB_REQ_EP_DIR_M) ==
                         USB_REQ_EP_DIR_IN) ? HALT_EP_IN : HALT_EP_OUT;

                //
                // Clear the halt condition on this endpoint.
                //
                psUSBControl->ucHalt[ulDir][usIndex - 1] = 1;
            }
            else
            {
                //
                // No other requests are supported.
                //
                USBDCDStallEP0(0);
                return;
            }
        }
        break;
    }

    //
    // This is an unknown request.
    //
    default:
    {
        USBDCDStallEP0(0);
        return;
    }
    }
}

//*****************************************************************************
//
// This function handles the SET_ADDRESS standard USB request.
//
// \param pvInstance is the USB device controller instance data.
// \param pUSBRequest holds the new address to use in the wValue field of the
// USB request.
//
// This function is called to handle the change of address request from the
// host controller.  This can only start the sequence as the host must
// acknowledge that the device has changed address.  Thus this function sets
// the address change as pending until the status phase of the request has
// been completed successfully.  This prevents the devices address from
// changing and not properly responding to the status phase.
//
// \return None.
//
//*****************************************************************************
static void
USBDSetAddress(void *pvInstance, tUSBRequest *pUSBRequest)
{
    tDeviceInstance *psUSBControl;

    ASSERT(pUSBRequest != 0);
    ASSERT(pvInstance != 0);

    //
    // Create the device information pointer.
    //
    psUSBControl = (tDeviceInstance *)pvInstance;

    //
    // Need to ACK the data on end point 0 with last data set as this has no
    // data phase.
    //
    USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

    //
    // Save the device address as we cannot change address until the status
    // phase is complete.
    //
    psUSBControl->ulDevAddress = readShort(&(pUSBRequest->wValue)) | DEV_ADDR_PENDING;

    //
    // Transition directly to the status state since there is no data phase
    // for this request.
    //
    psUSBControl->eEP0State = USB_STATE_STATUS;
}

//*****************************************************************************
//
// This function handles the GET_DESCRIPTOR standard USB request.
//
// \param pvInstance is the USB device controller instance data.
// \param pUSBRequest holds the data for this request.
//
// This function will return most of the descriptors requested by the host
// controller.  The descriptor specified by \e
// pvInstance->psInfo->pDeviceDescriptor will be returned when the device
// descriptor is requested.  If a request for a specific configuration
// descriptor is made, then the appropriate descriptor from the \e
// g_pConfigDescriptors will be returned.  When a request for a string
// descriptor is made, the appropriate string from the
// \e pvInstance->psInfo->pStringDescriptors will be returned.  If the \e
// pvInstance->psInfo->sCallbacks.GetDescriptor is specified it will be
// called to handle the request.  In this case it must call the
// USBDCDSendDataEP0() function to send the data to the host controller.  If
// the callback is not specified, and the descriptor request is not for a
// device, configuration, or string descriptor then this function will stall
// the request to indicate that the request was not supported by the device.
//
// \return None.
//
//*****************************************************************************
static void
USBDGetDescriptor(void *pvInstance, tUSBRequest *pUSBRequest)
{
    tBoolean bConfig;
    tDeviceInstance *psUSBControl;
    tDeviceInfo *psDevice;

    ASSERT(pUSBRequest != 0);
    ASSERT(pvInstance != 0);

    //
    // Create the device information pointer.
    //
    psUSBControl = (tDeviceInstance *)pvInstance;
    psDevice = psUSBControl->psInfo;

    //
    // Assume we are not sending the configuration descriptor until we
    // determine otherwise.
    //
    bConfig = false;

    //
    // Which descriptor are we being asked for?
    //
    switch(readShort(&(pUSBRequest->wValue)) >> 8)
    {
        //
        // This request was for a device descriptor.
        //
    case USB_DTYPE_DEVICE:
    {
        //
        // Return the externally provided device descriptor.
        //
        USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
        psUSBControl->pEP0Data =
            (unsigned char *)psDevice->pDeviceDescriptor;

        //
        // The size of the device descriptor is in the first byte.
        //
        psUSBControl->ulEP0DataRemain = psDevice->pDeviceDescriptor[0];

        break;
    }

    //
    // This request was for a configuration descriptor.
    //
    case USB_DTYPE_CONFIGURATION:
    {
        const tConfigHeader *psConfig;
        const tDeviceDescriptor *psDeviceDesc;
        unsigned char ucIndex;

        //
        // Which configuration are we being asked for?
        //
        ucIndex = (unsigned char)(readShort(&(pUSBRequest->wValue)) & 0xFF);

        //
        // Is this valid?
        //
        psDeviceDesc =
            (const tDeviceDescriptor *)psDevice->pDeviceDescriptor;

        if(ucIndex >= psDeviceDesc->bNumConfigurations)
        {
            //
            // This is an invalid configuration index.  Stall EP0 to
            // indicate a request error.
            //
            USBDCDStallEP0(0);
            psUSBControl->pEP0Data = 0;
            psUSBControl->ulEP0DataRemain = 0;
        }
        else
        {
            //
            // Return the externally specified configuration descriptor.
            //
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
            psConfig = psDevice->ppConfigDescriptors[ucIndex];

            //
            // Start by sending data from the beginning of the first
            // descriptor.
            //
            psUSBControl->ucConfigSection = 0;
            psUSBControl->ucSectionOffset = 0;
            psUSBControl->pEP0Data = (unsigned char *)
                                     psConfig->psSections[0]->pucData;

            //
            // Determine the total size of the configuration descriptor
            // by counting the sizes of the sections comprising it.
            //
            psUSBControl->ulEP0DataRemain =
                USBDCDConfigDescGetSize(psConfig);

            //
            // Remember that we need to send the configuration descriptor
            // and which descriptor we need to send.
            //
            psUSBControl->ucConfigIndex = ucIndex;

            bConfig = true;
        }
        break;
    }

    //
    // This request was for a string descriptor.
    //
    case USB_DTYPE_STRING:
    {
        long lIndex;

        //
        // Determine the correct descriptor index based on the requested
        // language ID and index.
        //
        lIndex = USBDStringIndexFromRequest(readShort(&(pUSBRequest->wIndex)),
                                            readShort(&(pUSBRequest->wValue)) & 0xFF);

        //
        // If the mapping function returned -1 then stall the request to
        // indicate that the request was not valid.
        //
        if(lIndex == -1)
        {
            USBDCDStallEP0(0);
            break;
        } else
        {
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
        }

        //
        // Return the externally specified configuration descriptor.
        //
        psUSBControl->pEP0Data =
            (unsigned char *)psDevice->ppStringDescriptors[lIndex];

        //
        // The total size of a string descriptor is in byte 0.
        //
        psUSBControl->ulEP0DataRemain =
            psDevice->ppStringDescriptors[lIndex][0];

        break;
    }

    //Manually stall any impossible descriptor requests. This is a hack to
    //pass certification, which requires a stall in response to a request
    //for a BOS descriptor. For some reason, the driver doesn't do this
    //properly, possibly because of the extra callback handler.
    case 0x06:	//Device qualifier -- high speed only
    case 0x07:	//Other speed config -- high speed only
    case 0x09:	//OTG -- not available on Octave, not supported on others (yet?)
    case 0x0F:	//BOS -- SuperSpeed only
    case 0x10:	//Device capability -- SuperSpeed only
    case 0x30:	//SuperSpeed endpoint companion -- SuperSpeed only
    	USBDCDStallEP0(0);
        psUSBControl->pEP0Data = 0;
        psUSBControl->ulEP0DataRemain = 0;
    	break;

    //
    // Any other request is not handled by the default enumeration handler
    // so see if it needs to be passed on to another handler.
    //
    default:
    {
        //
        // If there is a handler for requests that are not handled then
        // call it.
        //
        if(psDevice->sCallbacks.pfnGetDescriptor)
        {
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, false);
            psDevice->sCallbacks.pfnGetDescriptor(psUSBControl->pvInstance,
                                                  pUSBRequest);
            return;
        }
        else
        {
            //
            // Whatever this was this handler does not understand it so
            // just stall the request.
            //
            USBDCDStallEP0(0);
            psUSBControl->pEP0Data = 0;
            psUSBControl->ulEP0DataRemain = 0;
        }
        break;
    	}
    }

    //
    // If this request has data to send, then send it.
    //
    if(psUSBControl->pEP0Data)
    {
        //
        // If there is more data to send than is requested then just
        // send the requested amount of data.
        //
        if(psUSBControl->ulEP0DataRemain > readShort(&(pUSBRequest->wLength)))
        {
            psUSBControl->ulEP0DataRemain = readShort(&(pUSBRequest->wLength));
        }

        //
        // Now in the transmit data state.  Be careful to call the correct
        // function since we need to handle the configuration descriptor
        // differently from the others.
        //
        if(!bConfig)
        {
            USBDEP0StateTx(0);
        }
        else
        {
            USBDEP0StateTxConfig(0);
        }
    }
}

//*****************************************************************************
//
// This function determines which string descriptor to send to satisfy a
// request for a given index and language.
//
// \param usLang is the requested string language ID.
// \param usIndex is the requested string descriptor index.
//
// When a string descriptor is requested, the host provides a language ID and
// index to identify the string ("give me string number 5 in French").  This
// function maps these two parameters to an index within our device's string
// descriptor array which is arranged as multiple groups of strings with
// one group for each language advertised via string descriptor 0.
//
// We assume that there are an equal number of strings per language and
// that the first descriptor is the language descriptor and use this fact to
// perform the mapping.
//
// \return The index of the string descriptor to return or -1 if the string
// could not be found.
//
//*****************************************************************************
static long
USBDStringIndexFromRequest(unsigned short usLang, unsigned short usIndex)
{
    tString0Descriptor *pLang;
    unsigned long ulNumLangs;
    unsigned long ulNumStringsPerLang;
    unsigned long ulLoop;

    //
    // Make sure we have a string table at all.
    //
    if((g_psUSBDevice[0].psInfo == 0) ||
            (g_psUSBDevice[0].psInfo->ppStringDescriptors == 0))
    {
        return(-1);
    }

